ToTheMoonLee/dino_toy/sdkconfig.defaults
# -----------------------------------------------------------------------------
# dino_toy default config (recommended)
# -----------------------------------------------------------------------------
# Goal: a fresh clone can `idf.py set-target esp32s3` + `idf.py build` without
# opening menuconfig.
#
# Hardware assumption:
# - ESP32-S3 with 16MB flash
# - ESP-SR models stored in the `model` partition (SPIFFS)
# -----------------------------------------------------------------------------

# Target (still recommended to run: idf.py set-target esp32s3)
CONFIG_IDF_TARGET="esp32s3"

# Flash size (match 16MB partition table)
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="16MB"

# Partition table (includes `model` partition for ESP-SR models)
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions-16MB.csv"
CONFIG_PARTITION_TABLE_FILENAME="partitions-16MB.csv"
CONFIG_PARTITION_TABLE_OFFSET=0x8000
CONFIG_PARTITION_TABLE_MD5=y

# -----------------------------------------------------------------------------
# ESP Speech Recognition (ESP-SR)
# -----------------------------------------------------------------------------
CONFIG_SR_NSN_WEBRTC=y
CONFIG_SR_VADN_WEBRTC=y

# WakeNet9: enable ONE wake word model (matches code/README: 小鹿，小鹿)
CONFIG_SR_WN_WN9_XIAOLUXIAOLU_TTS2=y

# MultiNet: Chinese command model (required for offline commands)
CONFIG_SR_MN_CN_MULTINET7_QUANT=y

# -----------------------------------------------------------------------------
# Audio playback (used by roar SFX + cloud TTS playback)
# -----------------------------------------------------------------------------
CONFIG_AUDIO_PLAYER_ENABLE_MP3=y
CONFIG_AUDIO_PLAYER_ENABLE_WAV=y
CONFIG_AUDIO_PLAYER_LOG_LEVEL=0

# -----------------------------------------------------------------------------
# Cloud Voice (optional) - keep empty by default
# -----------------------------------------------------------------------------
CONFIG_CLOUD_TTS_PROXY_URL=""
CONFIG_CLOUD_CHAT_PROXY_URL=""
CONFIG_CLOUD_CHAT_PCM_PROXY_URL=""

# Dialog tuning defaults
CONFIG_DIALOG_SESSION_TIMEOUT_MS=45000
CONFIG_DIALOG_END_SILENCE_MS=450
CONFIG_DIALOG_ENERGY_GATE_MEAN_ABS=120
CONFIG_DIALOG_LOCAL_COMMAND_IGNORE_MS=800
CONFIG_DIALOG_MAX_UTTERANCE_MS=8000

